Repository: mozilla-l10n/mt-training-data
Catalog: ln/ln_pontoon.tmx
Source language: en_us
Languages: ln

source: Select language | {document}
ln: Pona lokota | {document}

source: Seller will not provide support
ln: Moteki akopesa lisungi te

source: Send
ln: Tinda

source: Send emails for private messages
ln: Tinda ba emails mpo na bamessage confidentielle

source: {sender} sent you the following message:
ln: {sender} atindeli yo message oyo elandi:

source: Send password reset link
ln: Tinda lien ya réinitialisation ya liloba ya sekele

source: Send Updates
ln: Kotinda ba mise à jour

source: Send username
ln: Tinda nkombo ya bosaleli

source: Sensible Settings
ln: Baparamètre Sensible

source: Sent Message
ln: Tinda Message

source: Sent Messages
ln: Tinda Bamessage

source: Setting a date and time on your Firefox OS phone
ln: Korègler mokolo na ntango na telefone nayo Firefox OS

source: Set up email
ln: Sala email

source: Share Data
ln: Kabola Badonnée

source: Share this article: {link}
ln: Kabola article oyo: {link}

source: Share web pages on Firefox for iOS
ln: Kabola ba web pages na Firefox mpo na iOS

source: Share your wisdom with the world.
ln: Kabola buanya nayo na mokili.

source: Show:
ln: Lakisa:

source: Show after
ln: Lakisa sima

source: Show All
ln: Lakisa nionso

source: Show all questions
ln: Lakisa mituna nionso

source: Show details &raquo;
ln: Lakisa badétail &raquo;

source: Show Everything
ln: Lakisa Biloko Nionso

source: Show Helpfulness Votes Chart
ln: Lakisa Graphique Ya Bavotes Ya Ntina

source: Show History
ln: Lakisa Lisitwale

source: Show information for:
ln: Lakisa bainfo mpo na:

source: Showing questions tagged:
ln: Kolakisa mituna oyo eza na tag:

source: Show less
ln: Lakisa moke

source: Show me
ln: Lakisa ngai

source: Show media for:
ln: Lakisa media mpo na:

source: Show more
ln: Lakisa mingi

source: Show translations
ln: Lakisa oyo elimbolami

source: Show Translations
ln: Lakisa Ndimbola

source: Show translations | {document}
ln: Lakisa ndimbola | {document}

source: Show until
ln: Lakisa kino

source: Signed in!
ln: Okoti!

source: Significance:
ln: Ntina:

source: Significance - MT: Major Content Changes. M: Content Changes. Empty: Minor Changes.
ln: Ntina - MT: Mbongwana Minene Ya Contenu. M: Mbongwana Ya Contenu. Polele: Mbongwana Mike-Mike Ya Contenu.

source: Sign in and connect to Twitter
ln: Kota mpe miconnecter na Twitter

source: Signing in...
ln: Oza kokota...

source: Sign in to Mozilla Support
ln: Kota na Mozilla Support

source: Sign out
ln: Bima

source: Sign up as a volunteer
ln: Mikomisa nati volontaire

source: "%s" is too large (%sKB), the limit is %sKB
ln: "%s" eza monene mingi (%sKB), suka eza %sKB

source: Sit back and relax. Our forum contributors will get back to you with an answer.
ln: Fuanda mpe kitisa motema. Bacontributeur ya forum nabiso bakozongela yo na eyano.

source: {sitename} Password Reset
ln: {sitename} Koretrouver Liloba ya sekele

source: Sites Affected
ln: Ba Site Affecté

source: Skip to main content
ln: Pimbwa na contenu principal

source: Skip to search
ln: Pimbwa na boluki

source: Slowness or hanging
ln: Bolembu to bokangami

source: Slug in {locale}:
ln: Slug na {locale}:

source: Solution chosen
ln: Solution eye eponami

source: Solution chosen by {user}
ln: Solution eye eponami na {user}

source: Solution didn't work
ln: Solution esali te

source: Solution found for question: %s
ln: Solution ezwami na motuna: %s

source: Solution found to Firefox Help question
ln: Solution ezwami na motuna ya Lisalisi ya Firefox

source: Solution provided
ln: Solution epesamaki

source: solved
ln: Eyanolami

source: Solved
ln: Eyanolami

source: Solved the problem
ln: Esilisaki nkokoso

source: Solves the problem
ln: Esilisi nkokoso

source: Solving 1 issue helps up to 1,000 users a day
ln: Kosilisa nkokoso moko ekosalisa ebele ya basaleli mokolo moko

source: Solving 1 issue helps up to 1,000 users a day!
ln: Kosilisa nkokoso moko ekosalisa ebele ya basaleli na mokolo!

source: Some features on this page are temporarily disabled while we perform website maintenance. Please try again a little later.
ln: Bacaractèristique songolo na lokasa oyo eza desactivé mpo na mua ngonga tango toza kosala entretien ya site web. Meka lisusu sima moke.

source: Some text will appear in the empty box.
ln: Mua makoma makomonana na sanduku ya polele.

source: Something is wrong
ln: Eloko moko eza malamu te

source: Sorry! Search is currently unavailable. Please try again soon.
ln: Bolimbisi! Boluki boza kozwama te na ngonga oyo. Meka lisusu mua sima.

source: Sorry to hear that.
ln: Mawa koyoka yango.

source: Sorry, we couldn't find the page you were looking for. Please, try searching our site using the form below.
ln: Bolimbisi, tokoki te kozwa lokasa oyo aza koluka. Meka kolukaluka na site nabiso na bosaleli formulaire oyo eza awa na se.

source: Sort options
ln: Baoption ya bolandisi

source: Sort results by
ln: Kolandisa baresultat na

source: Source Code
ln: Code Source

source: Spam or other unrelated content
ln: Spam to contenu mosusu oyo eza na ntina

source: <span class="key">Accessibility</span>: No
ln: <span class="key">Boengili</span>: Te

source: <span class="key">Accessibility</span>: Yes
ln: <span class="key">Boingeli</span>: Iyo

source: <span class="key">User JS</span>: No
ln: <span class="key">Mosaleli JS</span>: Te

source: <span class="key">User JS</span>: Yes
ln: <span class="key">Mosaleli JS</span>: Iyo

source: %s posted an answer to your question "%s"
ln: %s akotisaki eyano na motuna nayo "%s"

source: Stale
ln: Esili ngala

source: Start
ln: Ebandeli

source: Start:
ln: Ebandeli:

source: Start answering!
ln: Banda koyanola!

source: Status
ln: Lolenge

source: Stay in touch
ln: Zala connecter

source: Stay up to date with news feeds, blogs and social features
ln: Zala na basango ya sika sika na bacaractèristique ya basango ya Feeds, ba blogs mpe social

source: Sticky
ln: Bavisite ebele

source: Sticky this thread
ln: Tikela bavisite ebele na mulongo oyo

source: Stop article emails
ln: Stoper ba emails ya article

source: Stop email updates
ln: Stoper ba mise à jour na email

source: Stop Ignoring
ln: Stoper kopipe te

source: Stop receiving updates via email for this question.
ln: Stoper koyamba ba mise à jour na nzela ya email mpo na motuna oyo.

source: Stop watching this forum
ln: Kostoper kolanda forum oyo

source: Stop watching this locale
ln: Kostoper kolanda lokota oyo

source: Stop watching this thread
ln: Kostoper kolanda mulongo oyo

source: <strong>0</strong> questions in the last <strong>24 hours</strong> have no reply. <strong>Good job!</strong>
ln: <strong>0</strong> mituna na <strong>bangonga 24</strong> eleki, miyanolami te. <strong>Mosala kitoko!</strong>

source: <strong>%(awarder)s</strong> has awarded you the <strong>%(title)s</strong> badge!
ln: <strong>%(awarder)s</strong> apesi yo <strong>%(title)s</strong> badge!

source: <strong>{product}</strong> Support Forum
ln: <strong>{product}</strong> Forum Ya Lisungi

source: <strong>%(recent_unanswered_count)s question</strong> has no reply.
ln: <strong>%(recent_unanswered_count)s mituna</strong> miza na biyano te.

source: <strong>%(recent_unanswered_count)s</strong> question in the last <strong>24 hours</strong> has no reply. <a href="%(url)s">Help solve it!</a>
ln: <strong>%(recent_unanswered_count)s</strong> motuna na <strong>bangonga 24</strong> eleki, eyanolami te. <a href="%(url)s">Salisa koyanola yango!</a>

source: <strong>Warning:</strong> Accounts created before December 2010 may have issues logging in. Please reset your password below.
ln: <strong>Keba:</strong> Bacompte oyo ekelamaki liboso ya sanza ya zomi na mibale 2010 ekoki kozala na bankokoso mpo na kokota. Tosengi ete oréinitialiser liloba nayo ya sekele awa na se.

source: <strong>Warning:</strong> This revision has KB Helpfulness Votes associated with it. Deleting this revision will cause those votes to be deleted as well.
ln: <strong>Keba:</strong> Revision oyo eza na bavote ya Ntina na Oyo Etali Boyebi. Koboma revision oyo ekosala ete bavote wana ebomama mpe.

source: Subject:
ln: Moboku:

source: Submit for Review
ln: Tinda mpo na Bomenyolami

source: Submit Issue
ln: Tinda Likambo

source: Submitted {locale} translation:
ln: Ndimbola ya {locale} eye etindami:

source: Submitted revision:
ln: Revision eye etindami:

source: Submitted Revision Changes
ln: Mbongwana Ya Revision Oyo Etindami

source: Submitted translation:
ln: Ndimbola eye etindami:

source: Submitted Translation Changes
ln: Mbongwana Ya Ndimbola Oyo Etindami

source: Submit Your Changes
ln: Tinda Maye Obongoli

source: Subscribe...
ln: Mikomisa...

source: Subscribe to edit notifications
ln: Mikomisa na mayebisi ya bobongisi

source: Subscribe to feed
ln: Mikomisa na feed

source: Subscription confirmed.
ln: Inscription eza confirmer.

source: Successfully activated
ln: Eactivé malamu

source: Summarize your question in a sentence
ln: Resumer motuna nayo na phrase moko

source: Summary:
ln: Bokuse:

source: [SUMO] You have a new private message from [{sender}]
ln: [SUMO] Oza na message confidentielle moko kowuta na [{sender}]

source: Support Forum
ln: Forum ya Lisungi

source: Support Forum Home
ln: Accueil Ya Forum Ya Lisungi

source: Support Forum Metrics
ln: Bamesure Ya Forum Ya Lisungi

source: Support Questions
ln: Mituna Ya Lisungi

source: Switch language
ln: Balola lokota

source: Switch to desktop site
ln: Balusa na site ya ordinateur ya bureau

source: Switch to mobile site
ln: Baluka na site mobile

source: System
ln: Systeme

source: System Details
ln: Badétail ya Systeme

source: Systems and Languages
ln: Basysteme na Bankota

source: Tab basics
ln: Mateya ya ebandeli mpo na tab

source: Table of Contents
ln: Table des matières

source: Tabs
ln: Ba tabs

source: Tab settings
ln: Baparamètre ya tab

source: Tags
ln: Ba tags

source: Take Action:
ln: Sala eloko:

source: Take pictures, record videos and listen to music on your Firefox OS phone.
ln: Kanga bafoto, enregistrer bavidéo mpe yoka miziki na telefone nayo Firefox OS.

source: Tap here to go to the mobile version of the site.
ln: Beta awa mpo na kokende na site ya version mobile.

source: {t} | {d} Discussion | Knowledge Base
ln: {t} | {d} Lisolo | Oyo Etali Boyebi

source: Tell us about yourself!
ln: Lobela biso maye matali yo!

source: Tell us more.
ln: Lobela biso mingi.

source: Templates
ln: Bamodele

source: Templates are a way of reusing pieces of content across KB articles. You can create and update a set of instructions in one place, and then refer to it in other pages.
ln: Bamodele eza nzela ya kosalela lisusu biteni ya contenu nakati ya baarticle ya Oyo Etali Boyebi. Okoki kokela mpe kosala mise à jour ya mopiko ya mitindo na esika moko, mpe na sima komiréférer nayango na makasa misusu.

source: Text of the new revision:
ln: Makoma ya revision yasika:

source: Thanks,
ln: Matando,

source: Thanks!
ln: Matondo!

source: Thanks for joining Mozilla Support! To complete registration, you need to verify your email address.
ln: Matondo mpo na komisangisa na Mozilla Support! Mpo na kosilisa inscription, esengeli ovérifier adresse email nayo.

source: Thanks for letting us know you have this problem.
ln: Matondo mpo na kolobela biso ete ozali na nkokoso oyo.

source: Thanks for making us better!
ln: Matondo mingi mpo na kosala ete tozala malamu mpeza!

source: Thanks for taking the time to review these changes. Clicking Accept will make this version of the article live! Please take a moment to be sure all options are correct.
ln: Matondo mingi mpo na kozwa ntango ya komanyola maye mabongolami. Kocliquer Ndima ekofungola nzela ya article na version oyo! Zwa mua ntango mpo na ozala sure ete baoption nionso eza malamu.

source: Thanks for taking the time to review these changes. Please thank the editor and then give specific, constructive feedback about what you feel needs to change in order for the revision to be acceptable.
ln: Matondo mingi mpo na ntango ya komanyola maye mabongolami. Tonda editeur botondi mpe pesa feedback oyo esembolami mpe oyo ekosalisa na maye obanzi esengeli kobongolama mpo na revision endimama.

source: Thanks for your help! Just so you know, Firefox OS is not available in your locale yet, and it's possible this article will change before it is.
ln: Matondo mingi mpo na lisalisi nayo! Kaka ndenge oyebi, Firefox OS ezwami naino te na lokota nayo mpe article oyo ekoki kobongwana liboso ezwama na lokota nayo.

source: Thanks so much for your interest in helping users of Mozilla technologies!
ln: Matando mingi mpo na komipesa mpo na kosalisa basaleli ya batechnologie ya Mozilla!

source: Thanks, The Mozilla Support team
ln: Matondo, equipe ya Mozilla Support

source: Thank you for being awesome!
ln: Matondo ndenge osepelisi!

source: Thank you for choosing a solution!
ln: Matondo mpo na boponi solution!

source: Thank you for registering!
ln: Matondo mpo na komikomisa!

source: Thank you for your contribution to Mozilla Support!
ln: Matondo mpo na contribution nayo na Mozilla Support!

source: Thank you for your first contribution to the Mozilla support forums! You just made somebody's day!
ln: Matondo mpo na contribution nayo ya yambo na baforum ya lisungi ya Mozilla! Yasolo obongisi mpeza mokolo ya songolo to pakala!

source: Thank you once more. We are looking forward to seeing you more often around SUMO! Keep rocking!
ln: Matondo lisusu. Toza kozela komonanaka yo mingi na SUMO! Koba koika mpiko!

source: Thank you! Your question will appear on the site as soon as you confirm your email address. You should receive an email shortly with a link to confirm.
ln: Matondo! Motuna nayo ekomonana na site kala mingi te soki osilisi koconfirmer adresse email nayo. Okoyamba email kala mingi te na lien mpo na koconfirmer.

source: That e-mail address doesn't have an associated user account. Are you sure you've registered?
ln: Adresse email wana ezangi compte oyo elandani nayango. Oza sure ete osi omikomisi?

source: That tag does not exist.
ln: Tag wana eza te.

source: The basics of using bookmarks
ln: Mateya ya ebandeli mpo na kosalela ba bookmarks

source: The body content is too short (%(show_value)s characters). It must be at least %(limit_value)s characters.
ln: Contenu ya esika ya kati-kati ya makoma eza mokuse mingi (%(show_value)s characters). Esengeli ezala au moins na bacaractère %(limit_value)s.

source: The community forum is at %(url)s .
ln: Forum ya lingomba eza na %(url)s.

source: The content is too short (%(show_value)s characters). It must be at least %(limit_value)s characters.
ln: Contenu eza mokuse mingi (%(show_value)s characters). Esengeli ezala au moins na bacaractère %(limit_value)s.

source: The dashboard data is being loaded. This may take some time.
ln: Eza kocharger badonnée ya tableau de bord. Ekoki kozwa mua ntango.

source: The {default_locale} version has no approved content to show.
ln: Version {default_locale} ezangi contenu oyo endimami mpo na kolakisa.

source: The document %(document_title)s has a new revision that is ready for localization.
ln: Document %(document_title)s eza na revision yasika oyo elengelami mpo na kolimbolama.

source: The document has been deleted.
ln: Document ebomami.

source: The document "%s" does not exist.
ln: Document oyo "%s" eza te.

source: The {domain} team
ln: {domain} equipe

source: The email you entered ({new_email}) already exists in the system. The current email for your account is still {old_email}.
ln: Email oyo okomi ({new_email}) eza déjà na systeme. Email oyo ezosala mpo na compte nayo sik'oyo eza kaka {old_email}.

source: The flag is invalid.
ln: Bendele elongobani te.

source: The flag is valid and I fixed the issue.
ln: Bendele elongobani mpe nabongisaki nkokoso wana.

source: The following articles include this image:
ln: Baarticle oyo elandi eza na elili oyo:

source: The image "%s" does not exist.
ln: Elili "%s" eza te.

source: The message was deleted!
ln: Message ebomami!

source: The Mozilla Support team
ln: Equipe Ya Lisungi Ya Mozilla

source: The password reset link was invalid, possibly because it has already been used. Please request a new password reset.
ln: Lien ya réinitialisation ya liloba ya sekele elongobanaki te, tango mosusu eza mpo esi basaleli yango. Senga lisusu réinitialisation ya liloba ya sekele.

source: The question:
ln: Motuna:

source: The questions forum isn't available for {product} in {old_lang}, we have redirected you to the {new_lang} questions forum.
ln: Mituna ya forum ezwami te mpo na {product} na {old_lang}, totindi yo na mituna ya forum {new_lang}.

source: The questions forum isn't available in {old_lang}, we have redirected you to the {new_lang} questions forum.
ln: Mituna ya forum ezwami te na {old_lang}, totindi yo na mituna ya forum {new_lang}.

source: The question: '{title}' was marked as solved by its asker, {asker}.
ln: Motuna: '{title}' motiyamaki elembo bo moyanolami na motuni nayango, {asker}.

source: There are no articles.
ln: Article ata moko te eza.

source: There are no messages here.
ln: Message ata moko te eza awa.

source: There are no threads. Maybe you should create some!
ln: Mulongo moko te eza. Tango mosusu esengeli osala moko!

source: There are several ways in which you can get involved:
ln: Eza na banzela ebele oyo okoki komikotisa:

source: There are {total} users with at least one contribution in the last 90 days.
ln: Eza na basaleli {total} baye bapesi contribution ata moko na mikolo 90 mileki.

source: The refund request must be made within 10 business days of purchase.
ln: Bosenga mpo na bozongisi misolo esengeli esalema nakati ya mikolo 10 ya mosala uta bosombi.

source: There is no flagged content pending moderation.
ln: Contenu moko te eye etiyami bendele ekozela moderation.

source: There is no topic data available for the current selections.
ln: Sujet ata moko te eza mpo na oyo eponami sik'oyo.

source: The requested image could not be found.
ln: Elili eye esengami ekoki kozwama te.

source: There was an error submitting the ticket. Please try again later.
ln: Erreur esalemaki na botindi ticket. Meka lisusu sima.

source: There was a problem confirming your subscription.
ln: Nkokoso ebimelaki tango ya koconfirmer inscription nayo.

source: There was a problem unsubscribing.
ln: Nkokoso esalemi tango ya kolongola inscription.

source: There were errors adding leaders to the group, see below.
ln: Baerreur esalemaki tango ya kobakisa bakambi ya groupe, tala awa na se.

source: There were errors adding members to the group, see below.
ln: Baerreur esalemaki tango ya kobakisa bamembre na groupe, tala awa na se.

source: There were errors adding new contributors, see below.
ln: Erreur esalemaki na bobakisi bacontributeur yasika, tala awa na se.

source: There were errors adding users, see below.
ln: erreur esalemaki na bobakisi basaleli, tala awa na se.

source: These are the top 50 most visited articles in the last 30 days.
ln: Oyo eza baarticle 50 ya likolo eye etalemi mingi na mikolo 30 mileki.

source: These fine people helped write this article: %(contributors)s. You can help too - <a href="%(link)s">find out how</a>.
ln: Batu oyo malamu basalisaki kokoma article oyo: %(contributors)s. Okoki mpe kosalisa - <a href="%(link)s">luka oyeba ndenge nini</a>.

source: These minor changes are not important for localizers and they will not be notified.
ln: Mbongwana mike mike oyo mizali ya litomba te mpo na balimboli mpe tokoyebisa mpo nayango te.

source: The {sitename} team
ln: Equipe {sitename}

source: The slug is too short (%(show_value)s characters). It must be at least %(limit_value)s characters.
ln: Slug eza mokuse mingi (%(show_value)s characters). Esengeli ezala au moins na bacaractère %(limit_value)s.

source: The slug provided is not valid.
ln: Slug oyo opesi elongobani te.

source: The solution was undone successfully.
ln: Solution elongolami malamu.

source: The subject is too short (%(show_value)s characters). It must be at least %(limit_value)s characters.
ln: Moboku eza mokuse mingi (%(show_value)s characters). Esengeli ezala au moins na bacaractère %(limit_value)s.

source: The summary is too short (%(show_value)s characters). It must be at least %(limit_value)s characters.
ln: Résumé eza mokuse mingi (%(show_value)s characters). Esengeli ezala au moins na bacaractère %(limit_value)s.

source: The SUMO Army of Awesome 2010 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2010; in this case: 50 Army of Awesome tweets. Congrats to all SUMO Army of Awesome 2010 badge earners for advancing the Mozilla Mission!
ln: Mini-badge ya SUMO Army of Awesome 2010 eza moko ya ba series SUMO. Eza kolakisa contribution na SUMO na mobu 2010; mpo na yango: ba tweets 50 na Army of Awesome. Longonia na baye banso bazwaki badge ya SUMO Army of Awesome 2010 mpo na komema Mission ya Mozilla o boso!

source: The SUMO Army of Awesome 2011 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2011; in this case: 50 Army of Awesome tweets. Congrats to all SUMO Army of Awesome 2011 badge earners for advancing the Mozilla Mission!
ln: Mini-badge ya SUMO Army of Awesome 2011 eza moko ya ba series SUMO. Eza kolakisa contribution na SUMO na mobu 2011; mpo na yango: ba tweets 50 na Army of Awesome. Longonia na baye banso bazwaki badge ya SUMO Army of Awesome 2011 mpo na komema Mission ya Mozilla o boso!

source: The SUMO Army of Awesome 2012 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2012; in this case: 50 Army of Awesome tweets. Congrats to all SUMO Army of Awesome 2012 badge earners for advancing the Mozilla Mission!
ln: Mini-badge ya SUMO Army of Awesome 2012 eza moko ya ba series SUMO. Eza kolakisa contribution na SUMO na mobu 2012; mpo nayango: ba tweets 50 na Army of Awesome. Longonia na baye banso bazwaki badge ya SUMO Army of Awesome 2012 mpo na komema Mission ya Mozilla o boso!

source: The SUMO Army of Awesome 2013 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2013; in this case: 50 Army of Awesome tweets. Congrats to all SUMO Army of Awesome 2013 badge earners for advancing the Mozilla Mission!
ln: Mini-badge ya SUMO Army of Awesome 2013 eza moko ya ba series SUMO. Eza kolakisa contribution na SUMO na mobu 2013; mpo nayango: ba tweets 50 na Army of Awesome. Longonia na baye banso bazwaki badge ya SUMO Army of Awesome 2013 mpo na komema Mission ya Mozilla o boso!

source: The SUMO Army of Awesome 2014 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2014; in this case: 50 Army of Awesome tweets. Congrats to all SUMO Army of Awesome 2014 badge earners for advancing the Mozilla Mission!
ln: Mini-badge ya SUMO Army of Awesome 2014 eza moko ya ba series ya SUMO. Eza kolakisa contribution na SUMO na mobu 2014; mpo na yango: 50 tweets na Army of Awesome. Longonia na baye banso bazwaki badge SUMO Army of Awesome 2014 mpo na komema Mission ya Mozilla o boso!

source: The SUMO Forum 2010 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2010 in this case: 30 replies in the English SUMO Forum. Congrats to all SUMO Forum 2010 badge earners for advancing the Mozilla Mission!
ln: Mini-badge ya Forum SUMO 2010 eza moko ya ba series SUMO. Eza kolakisa contribution na SUMO na mobu 2010; mpo na yango: biyano 30 na Forum SUMO na lokota ya Angele. Longonia na baye banso bazwaki badge ya Forum SUMO 2010 mpo na komema Mission ya Mozilla o boso!
